Lesson 9

pandas dates

Timestamp

In [2]:
import pandas as pd

In [3]:
pd.to_datetime('30/10/2021 02:12:20.1000')

Timestamp('2021-10-30 02:12:20.100000')

In [5]:
Out[3] - pd.to_datetime('30/10/2021 01:12:20.1000')

Timedelta('0 days 01:00:00')

In [6]:
pd.to_datetime(['01/01/2020', '02/01/2020', '03/01/2020', '04/01/2020'])

DatetimeIndex(['2020-01-01', '2020-02-01', '2020-03-01', '2020-04-01'], dtype='datetime64[ns]', freq=None)

In [8]:
string_table = pd.DataFrame(data=[['fried rice'], ['mac n cheese'], ['fried fish'], ['fish n chips']], columns=['name'])
string_table

           name
0    fried rice
1  mac n cheese
2    fried fish
3  fish n chips

In [9]:
string_table['name'].str.upper()

0      FRIED RICE
1    MAC N CHEESE
2      FRIED FISH
3    FISH N CHIPS
Name: name, dtype: object

In [10]:
string_table['name'].str.replace(' n ', ' and ')

0        fried rice
1    mac and cheese
2        fried fish
3    fish and chips
Name: name, dtype: object

In [11]:
string_table['name'].str.contains('fish')

0    False
1    False
2     True
3     True
Name: name, dtype: bool

In [12]:
string_table['name'] + ', yummy!'

0      fried rice, yummy!
1    mac n cheese, yummy!
2      fried fish, yummy!
3    fish n chips, yummy!
Name: name, dtype: object

In [14]:
string_table.name.isin(['fried rice'])

0     True
1    False
2    False
3    False
Name: name, dtype: bool

In [18]:
import numpy as np

In [19]:
marks = np.random.randint(5, 101, size = 40)
marks

array([ 7, 57, 39, 35, 24, 34, 15, 32, 69, 47, 98, 15, 80, 44, 97, 33, 33,
       89, 10, 61, 30, 37, 51, 43, 85, 91, 56, 24, 97, 76,  6, 52, 26, 46,
       91, 73,  5, 37, 29, 95])

In [28]:
def to_american_system(number):
    if 80 < number <= 100:
        return 'A'
    elif 60 < number <=80:
        return 'B'
    elif 40 < number <= 60:
        return 'C'
    elif 20 < number <= 40:
        return 'D'
    elif 0 <= number <= 20:
        return 'C'

In [32]:
marks_df = pd.DataFrame(marks, columns=['mark'])
marks_df

    mark
0      7
1     57
2     39
3     35
4     24
5     34
6     15
7     32
8     69
9     47
10    98
11    15
12    80
13    44
14    97
15    33
16    33
17    89
18    10
19    61
20    30
21    37
22    51
23    43
24    85
25    91
26    56
27    24
28    97
29    76
30     6
31    52
32    26
33    46
34    91
35    73
36     5
37    37
38    29
39    95

In [43]:
marks_df.mark.apply(to_american_system)

0     C
1     C
2     D
3     D
4     D
5     D
6     C
7     D
8     B
9     C
10    A
11    C
12    B
13    C
14    A
15    D
16    D
17    A
18    C
19    B
20    D
21    D
22    C
23    C
24    A
25    A
26    C
27    D
28    A
29    B
30    C
31    C
32    D
33    C
34    A
35    B
36    C
37    D
38    D
39    A
Name: mark, dtype: object

In [46]:
df1 = pd.DataFrame({'A': [1, 2, 3, 4], 'B': [5, 6, 7, 8]})
df2 = pd.DataFrame({'A': [100, 150, 200], 'B': [300, 400, 500]})

pd.concat([df1, df2], axis='index')

     A    B
0    1    5
1    2    6
2    3    7
3    4    8
0  100  300
1  150  400
2  200  500